import 'dart:math';
import 'package:bloc/bloc.dart';
import 'package:faleh_hafez/domain/omen_model.dart';
import 'package:flutter/material.dart';

part 'omen_list_event.dart';
part 'omen_list_state.dart';

List<Omen> omenList = [
  //* good omens
  // 1
  Omen(
    omenText:
        'روز‌های زیبا و شادی برای شما فراخواهد آمد. امیدوار باشید و به رویاهایتان پایبند بمانید، آن‌ها در کوتاه‌ترین زمان ممکن به واقعیت تبدیل خواهند شد.',
  ),
  // 2
  Omen(
    omenText:
        'شما در مسیری هستید که به سوی موفقیت و رضایت بیشتر از زندگی می‌برد. افکار مثبت خود را حفظ کنید و با انرژی مثبتتان، به سمت دستاوردهای بزرگ حرکت کنید.',
  ),
  // 3
  Omen(
    omenText:
        'هر روز با افکار مثبت و انرژی خود را شارژ کنید، چرا که آینده‌ای درخشان در انتظار شماست. با پشتکار و تلاش مداوم، به دستاوردهای بیشتری دست خواهید یافت.',
  ),
  // 4
  Omen(
    omenText:
        'زندگی پر از زیبایی‌ها و لحظات خوبی است. شما در مسیری هستید که می‌تواند به شادی و موفقیت بیشتری منجر شود. از این لحظات لذت ببرید و به آرامش و خوشبختی دست پیدا کنید.',
  ),
  // 5
  Omen(
    omenText:
        'راه‌حل‌ها و فرصت‌های بی‌شماری در پیش روی شماست. با اعتماد به نفس و پشتکار، می‌توانید به دستاوردهای بزرگی دست یابید. امیدوار باشید و به توانایی‌هایتان اعتماد کنید.',
  ),
  // 6
  Omen(
    omenText:
        'امروز فرصت‌های جدیدی برای شروع چیزهای جذاب و خلاقانه پیش روی شماست. انرژی مثبتتان را تغییر بدهید و با اعتماد به نفس، به سمت دستاوردهای جدید حرکت کنید. این یک زمان مناسب برای اعمال تغییرات سازنده در زندگی شماست.',
  ),

  //* bad omens
  // 1
  Omen(
    omenText:
        'ممکن است در روزهای آینده با چالش‌ها و موانعی روبه‌رو شوید. اما به یاد داشته باشید که هر چالشی فرصتی برای رشد و یادگیری نیز می‌باشد.',
  ),
  // 2
  Omen(
    omenText:
        'انرژی منفی ممکن است در اطراف شما حضور داشته باشد. سعی کنید از آن دوری کنید و به جای آن، به افراد و اتفاقات مثبت توجه کنید تا از برخوردهای مثبت بهره‌مند شوید.',
  ),
  // 3
  Omen(
    omenText:
        'احتمال وقوع موضوعات ناخوشایندی وجود دارد، اما این موضوعات یک دوران محدودی را در بر خواهند داشت. سعی کنید با ثابت قدمی و حل مسائل به سرعت از این وضعیت عبور کنید.',
  ),
  // 4
  Omen(
    omenText:
        'احتمال وقوع برخی موانع یا مشکلات در آینده وجود دارد. اما این مشکلات می‌توانند فرصت‌هایی برای یادگیری و رشد باشند. با اطمینان و انعطاف، می‌توانید این موانع را پشت سر بگذارید.',
  ),
  // 5
  Omen(
    omenText:
        'گاهی اوقات ممکن است احساس کنید که همه چیز متوقف شده است یا در جایی دچار مسدودی هستید. اما این یک مرحله موقت است. با تلاش و پیگیری، راه حل‌های جدید و پویا پیدا خواهید کرد.',
  ),
  // 6
  Omen(
    omenText:
        'ممکن است در روزهای آینده با چالش‌هایی مواجه شوید که نیازمند تمرکز و پشتکار بیشتری هستند. این چالش‌ها ممکن است باعث ایجاد استرس و نگرانی شوند، اما با انعطاف و تمرکز بر روی راه‌حل‌ها، قادر به پیشروی خواهید بود.',
  ),

  //* nitral omens
  // 1
  Omen(
    omenText:
        'آینده همواراً پر از چالش‌ها و فرصت‌هاست. هر چیزی که در پیش روی شماست، با وابستگی به تصمیمات و اقدامات شماست.',
  ),
  // 2
  Omen(
    omenText:
        'زندگی همواره با اتفاقات مختلفی پر است که نه همیشه مثبت و نه همیشه منفی هستند. مهمترین نکته این است که چگونه با آن‌ها برخورد می‌کنید.',
  ),
  // 3
  Omen(
    omenText:
        'تغییراتی در راه است که ممکن است برای شما مهم باشند، اما احتمالاً نه همیشه از نظر مثبت یا منفی. هرچیزی به دور از این دو قطبیت می‌تواند باشد.',
  ),
  // 4
  Omen(
    omenText:
        'آینده همیشه مملو از انتخاب‌ها و اتفاقات مختلف است. هیچ کس نمی‌تواند با دقت کامل آینده را پیش‌بینی کند. به آرامی و با دقت، تصمیمات خود را بگیرید.',
  ),
  // 5
  Omen(
    omenText:
        'گاهی اوقات زندگی به صورت پیوسته تغییر می‌کند. شما باید قادر باشید با این تغییرات سازگاری پیدا کنید و برای حفظ تعادل درونی خود تلاش کنید.',
  ),
  // 6
  Omen(
    omenText:
        'زندگی مسیری پر از تناقضات و تغییرات است. هر دو موقعیت مثبت و منفی در پیش روی شما قرار دارند. از این تناقضات به عنوان یک فرصت برای رشد و یادگیری استفاده کنید. حتی در مواقعی که به نظر نیترال می‌آیند، می‌توانند درس‌های مفیدی داشته باشند.',
  ),
];

class OmenListBloc extends Bloc<OmenListEvent, OmenListState> {
  OmenListBloc() : super(OmenListInitial()) {
    on<OmenListShowOmenEvent>((event, emit) async {
      emit(OmenListLoading());

      final Random random = Random();
      final int randomIndex = random.nextInt(omenList.length);
      final selectedOmen = omenList[randomIndex];

      await Future.delayed(
        const Duration(
          seconds: 2,
        ),
      );

      emit(
        OmenListLoaded(
          omen: selectedOmen,
        ),
      );
    });
  }
}
